{
  "architectures": [
    "ModernBertModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 179934,
  "classifier_activation": "silu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "cls",
  "cls_token_id": 179934,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 179938,
  "export_model_type": "transformer",
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 150000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "silu",
  "hidden_size": 384,
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 160000.0,
  "max_position_embeddings": 32768,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 179935,
  "position_embedding_type": "absolute",
  "repad_logits_with_grad": false,
  "sep_token_id": 179938,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "transformers_version": "4.57.6",
  "vocab_size": 180000
}
